html/comp-sci/numerical-analysis/floating-point-arithmetic.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-04-04 Sun 18:11 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Floating Point Arithmetic</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Alex Nelson">
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Floating Point Arithmetic</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2bc69f6">1. Representing numbers</a>
<ul>
<li><a href="#orgc3697c6">1.1. Motivational example</a></li>
<li><a href="#orgd3ef1b5">1.2. Rounding, Truncating</a></li>
<li><a href="#org6c654f2">1.3. Relative, Absolute Error</a></li>
</ul>
</li>
<li><a href="#org7e6988a">2. References</a></li>
</ul>
</div>
</div>


<div id="outline-container-org2bc69f6" class="outline-2">
<h2 id="org2bc69f6"><span class="section-number-2">1</span> Representing numbers</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgc3697c6" class="outline-3">
<h3 id="orgc3697c6"><span class="section-number-3">1.1</span> Motivational example</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The basic idea could be discussed by first considering a number
system where a "number" is a triple <code>(s, c, f)</code> where
</p>
<ul class="org-ul">
<li><code>s</code> is either +1 or -1</li>
<li><code>c</code> is a 7-tuple of digits <code>(c[0], ..., c[6])</code> where <code>c[0]</code> is nonzero</li>
<li><code>f</code> is a 4-tuple of <code>(f[0], f[1], ..., f[3])</code> where <code>f[0]</code> is
either +1 or -1, and the remaining components are digits</li>
</ul>

<p>
We intuitively think of this as a sort of truncated scientific
notation <code>s*(c[0].c[1]c[2]c[3]c[4]c[5]c[6])*pow(10, f[0]*(f[1]f[2]f[3]))</code>
where the <code>c</code> is a decimal encoding of a real number, <code>f[1:3]</code> encodes a
3-digit natural number.
</p>

<p>
Observe, if <code>c[0]</code> were zero, we could shift all the <code>c</code> tuple
entries down by one (i.e., set <code>c'[0] = c[1]</code>, <code>c'[1] = c[2]</code>, &#x2026;,
<code>c'[5]=c[6]</code>, then set <code>c'[6]=0</code> and use <code>c'</code> instead of <code>c</code> at the
cost of decreasing the <code>f</code> exponent by 1). Consequently, the only
time <code>c[0]</code> were zero is if we had zero.
</p>

<p>
There's no reason why we <i>must</i> use base-10, we could use base
<i>b</i>. We just require <code>c[0]</code> is a nonzero <i>b</i>-igit, and we interpret
the order of magnitude is taken to base-<i>b</i>, i.e., that we multiply
now by <code>pow(b, f[0]*(f[1]f[2]f[3]))</code>. For base-2, this forces
<code>c[0]</code> to be 1, and hence we can just assume there is an implicit
leading 1 (i.e., we can pretend the <code>c</code> tuple describes the bits
"after the decimal point").
</p>
</div>
</div>

<div id="outline-container-orgd3ef1b5" class="outline-3">
<h3 id="orgd3ef1b5"><span class="section-number-3">1.2</span> Rounding, Truncating</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Given some number with decimal expansion
<code>d[0]d[1]d[2]d[3]d[4]d[5]d[6]d[7]...</code>, how do we encode it in our
toy number system?
</p>

<ul class="org-ul">
<li><b>Solution 1.</b> Do we simply throw away the digits <code>d[7]</code> and
beyond? This is called "truncating".</li>
<li><b>Solution 2.</b> Or we could examine <code>d[7]</code> and if it is 5 or greater,
add 1 to <code>d[6]</code> (which, if <code>d[6]=9</code>, would become 0 and force us to
"carry the one" to <code>d[5]</code>, and so on). This is "rounding to infinity".</li>
</ul>

<p>
Either way, rounding/truncating is one source of error. But it's a
price we always have to pay for using a computer.
</p>

<div class="definition" id="org03362db">
<p>
Let \(x\) be a real number. Then the encoding of it to our number
system corresponds to mapping it to the number \(fl(x)\).
</p>

</div>

<p>
We will continue working in our system of 7-digit scientific numbers,
with 3-digit exponents.
</p>

<div class="remark" id="org487f5cf">
<p>
The choice of 7 digits and 3-digit exponents is not arbitrary, this
turns out to be one of the standard floating point representations for
numbers, the single-precision decimal float. Working in base-10 is more
familiar to the reader than working in base-2 (at least, for scientific
computation), so we use it to clarify certain concepts.
</p>

</div>
</div>
</div>

<div id="outline-container-org6c654f2" class="outline-3">
<h3 id="org6c654f2"><span class="section-number-3">1.3</span> Relative, Absolute Error</h3>
<div class="outline-text-3" id="text-1-3">
<p>
How do we measure how good (or bad) an approximation is to its true
value? We have two possibilities.
</p>

<div class="definition" id="orge62dcba">
<p>
Let \(x\) be a real number and \(x_{\ast}\) an approximation to
\(x\). Then its <dfn>Absolute Error</dfn> is \(|x - x_{\ast}|\).
</p>

</div>

<div class="definition" id="org243a5a7">
<p>
Let \(x\) be a real number and \(x_{\ast}\) an approximation to
\(x\). Then its <dfn>Relative Error</dfn> is \(|x - x_{\ast}|/x\) if \(x\neq0\).
</p>

</div>

<div class="math-example" id="org3264758">
<p>
When we have two numbers close to each other \(fl(x)\approx fl(y)\),
say they agree to 4 digits, then \(fl(x) - fl(y)\)
has at most three digits of precision (we've lost more than half our
precision). The absolute error of \(fl(x) - fl(y)\) compared to \(x - y\)
is small, though the relative error is large.
</p>

</div>
</div>
</div>
</div>


<div id="outline-container-org7e6988a" class="outline-2">
<h2 id="org7e6988a"><span class="section-number-2">2</span> References</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Richard L. Burden and J. Douglas Faires,
<cite class="book-title">Numerical Analysis</cite>.
8th ed., Thomson, 2005.</li>
<li>David Goldberg,
"What Every Computer Scientist Should Know About Floating-Point Arithmetic".
March 1991, <a href="https://docs.oracle.com/cd/E19957-01/806-3568/ncg_goldberg.html">eprint</a>.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2021-02-15 Mon 09:26.</p>
</div>
</body>
</html>